# include <iostream>
using namespace std;
void main() {
	//Написать программу вычисления суммы четных и кубов нечетных чисел от 1 до N.

	//int a=1,b=1,n;
	//cin >> n;
	//for(int i=0;i<n;i++){
	////	if(a%2==0){
	//		a+=a;
	////	}
	////	else{
	//		b=b*b*b;
	//	//}
	//	cout << a << endl ;//<< b << endl;
	//}
	

	int a;
a=5.3%2+2*2;
cout<<a;



}