#include <iostream>
using namespace std;
void main()
{
	// 1. Напишите программу, проверяющую число, введенное с клавиатуры на четность.


//int a;
//	cout << "Enter a number: ";
//	cin >> a;
//	if(a%2==0)
//	{
//		cout << "Your number is even\n\n";
//	}
//	else cout << "Your number is uneven\n\n";


	//2. Дано натуральное число а (a<100). Напишите программу, выводящую на экран количество цифр в этом числе и сумму этих цифр

	//int a, num1, num2, res;	
	//cout << "Enter number smaller than 100: ";
	//cin >> a;
	//cout << endl;
	//if(a<100)
	//{
	//	cout << a << endl;
	//		num1=a/10;
	//	cout << num1 << endl;
	//		num2=a%10;
	//	cout << num2 << endl;
	//	cout << num1+num2 << endl;
	//}
	//else
	//{
	//	cout << "Your number bigger than 100\nbye!!!\n";
	//}
	
		
	//3. Известно, что 1 дюйм равен 2.54 см. Разработать приложение, переводящие дюймы в сантиметры и наоборот. Диалог с пользователем реализовать через систему меню.


	//const float inch=2.54;
	//float cm, res;
	//cout << "Enter value: ";
	//cin >> cm;
	//cout << endl;
	//cout << "If you want convert cm to inches press 1\n\n";
	//cout << "If you want convert inches to cm press 0\n";
	//char a;
	//cin >> a;
	//switch(a){
	//case '0':
	//	res=cm*2.54;
	//	cout <<"You have "<< res <<" cm\n";
	//	break;
	//case '1':
	//	res=cm/2.54;
	//	cout << "You have "<< res <<" inches\n";
	//	break;
	//default:    
	//	cout<<"\nError!!! This operator isn't correct\n";
	//	break; 
	//}


	//4. Напишите программу, реализующую популярную телевизионную игру "Кто хочет стать миллионером". 


	//bool startgame;
	//cout << "If you want to play, press 1, or press 0 to quit: ";
	//cin >> startgame;
	//if(startgame)
	//{
	//	cout << "OK, let's start !\n";
	//	cout << "Which person is in the 100$\n";
	//	cout << "If you mean a Franklin, press 1\n";
	//	cout << "If you mean a Shevchenko, press 0\n";
	//	bool ans;
	//	cin >> ans;
	//	(ans!=0)?cout<<"\nYou are right and you win, let's continue\n":cout<<"\nError!!! Answer isn't correct, you are lose, see you later\n";
	//	
	//}


	//else
	//{
	//	cout << "Have a nice day, bye !!!\n";
	//}
	
}